Day 6: How do I remove columns from a pandas DataFrame?

In [18]:
import pandas as pd

In [19]:
ufo = pd.read_csv('https://bit.ly/uforeports')

In [20]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [22]:
ufo.shape

(18241, 5)

If you want to get rid of colors reported column. We can use drop method which is a dataframe method.

In [23]:
ufo.drop('Colors Reported', axis=1, inplace=True) # Axis is general is direction axis 0 is the row direction where axis 1 is the column. Inplace true mean that you want the operation to occur at the same place. Note: column is also referred as series data.

In [24]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [25]:
ufo.drop(['City', 'State'], axis=1, inplace=True) # Can drop mutliple columns at the same time by passing a list of columns.

In [26]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [27]:
ufo.drop([0,1], axis=0, inplace=True) # drop rows, using indeces or labels which can be a list. Like we want to remove entries before 1931.

In [29]:
ufo.head()

  Shape Reported             Time
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30
6         CIRCLE   6/15/1935 0:00

In [30]:
ufo.shape

(18239, 2)